token = "e0e4450783ab2658747e2b4902c5963f2df732f921f0e47fdd6224200b269717f9c77095ac46481fdd50a"
group_id = 179410262

login_id = 'di.sofi.id@yandex.ru'# '79778998917'
pass_id =  'Ifn$1326' #'Qaz999999+'
#token_user = "19a8049eb3ef497a1a5bcf74b498fa45e41cc62c384baa28db89819e301b3a88cf6b5a460aef408d93de0"
a_token = "5380fbe31aed9d1cb604747e1ad8dbb963de8ef9474cbe4320557735d17236e611559fc02fa32855da2b4"
#ВСЕ ПЕРЕМЕННЫЕ WHO I

reputation = ''

item1 = ''

item2 = ''

status_bot = 1

type_typing = 'typing'

in_chat = ''

var = 0

response1 = ''

#цикл спама
g1 = 0

weel ={}#словарь по колесу фортуны

response2 = ''

voice_number =0

xop = 0 #счетчик

not_helper = []

newsletter = [] #КТО ВХОДИЛ В VIP РАССЫЛКУ

list_voices = ['nrx','борис','оксана','джейн','колян','артем','таня','элис']

list_responses = ['!админ', 'еще 🎲', 'хватит ✅', 'перекинуть ♻', 'http', '.ru' , '.com', '.net', '♻', '!найти', 'vk.com', '@']

hack = 'Меню - действия над собеседником 👤'

list_admin = ['!админ', '!вип-', '!вип+', '!алмазы+' '!стата']

list_bets = ['5','10','15','30']

reputation_talker =''

admin = 0 #в админке или нет

all_list = []

cod = 0 #пользователь который вводит код

fwd = []

third_list = [] #беседа

info = '' #инфа о даймодах

duhs = [] #список написавших пользователей

que =[] #список пользователей в очереди ожидания

q = {} #БД пользователей

zonk = {} #ИГРОВАЯ БД

players = []

#perk = 0 #вип статус

zonk1 = 0 #сыграем в зонк?

get_messages_atta = [] #прикрепл. в сообщ.

type_atta = [] #тип прикреп в сообщ.

len_buf = 0 #количество прикрепляемых фоток

convers = 0 #диалог тек. пользователя

#in_chat = 0 #тек. пользователь в чате?

hi = 1 #приветствовали или нет

code = 0 #вводит ли пользователь код

code14 = [] #VIP коды на 14 дней

code31 = [] #VIP коды на 31 день

diamonds150 = []#коды на 150 алмазов

days = 0 #количество VIP дней

last_rec = 0 #последняя запись

lot = 0 #количество получаемых алмазов

deleted_items = []

plm = []

sticker_id = 0
q1 = 0

g_rep = 15
p_rep = 15

send =''
send_q1 = 0
send_sticker_id = 0

vip = '♔VIP♔' #'✸𝐕𝐈𝐏✸'
talker = '✦Anonim✦' #'✦𝐓𝐀𝐋𝐊𝐄𝐑✦'
rep1 = '✦Introvert✦'
rep2 = '✦Lover to chat✦'
rep3 = '✦Interesting companion✦'

tit = talker
bot = '✦N.R.X✦' #'✦WHOI BOT✦'
